## Terraform Plan — Production

<details>
<summary>Click to expand plan output</summary>

```hcl
tls_private_key.self_signed: Refreshing state... [id=d5d7283420669f98d4d38ba3b7f367e5ae6229dd]
tls_self_signed_cert.self_signed: Refreshing state... [id=339694501460779637163185957500613097882]
aws_acm_certificate.self_signed: Refreshing state... [id=arn:aws:acm:us-east-2:371670420772:certificate/54cfbb79-4640-4836-b3ff-f2f483df501d]
data.aws_ecr_repository.api[0]: Reading...
module.iam_api_task_role.aws_iam_role.this: Refreshing state... [id=exam-costa-production-api-task-role]
module.ecs_cluster.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-2:371670420772:cluster/exam-costa-production-cluster]
module.iam_worker_task_role.aws_iam_role.this: Refreshing state... [id=exam-costa-production-worker-task-role]
module.iam_ecs_execution_role.aws_iam_role.this: Refreshing state... [id=exam-costa-production-ecs-execution-role]
data.aws_ssm_parameter.api_token: Reading...
data.aws_caller_identity.current: Reading...
module.ecs_service_worker.aws_cloudwatch_log_group.service: Refreshing state... [id=/ecs/exam-costa-production-worker]
module.ecs_service_api.aws_cloudwatch_log_group.service: Refreshing state... [id=/ecs/exam-costa-production-api]
data.aws_caller_identity.current: Read complete after 0s [id=371670420772]
data.aws_ecr_repository.worker[0]: Reading...
data.aws_ssm_parameter.api_token: Read complete after 0s [id=/exam-costa/production/api/token]
module.sqs_messages.aws_sqs_queue.dlq[0]: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/371670420772/exam-costa-production-messages-dlq]
module.network.aws_vpc.main: Refreshing state... [id=vpc-067e0daa18672ab26]
module.network.data.aws_region.current: Reading...
module.network.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.iam_ecs_execution_role.aws_iam_role_policy_attachment.managed[0]: Refreshing state... [id=exam-costa-production-ecs-execution-role-20260329020634331800000001]
module.s3_messages.aws_s3_bucket.this: Refreshing state... [id=exam-costa-production-messages-371670420772]
module.ecs_cluster.aws_ecs_cluster_capacity_providers.main: Refreshing state... [id=exam-costa-production-cluster]
module.sqs_messages.aws_sqs_queue.main: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/371670420772/exam-costa-production-messages]
data.aws_ecr_repository.api[0]: Read complete after 0s [id=exam-costa-api]
data.aws_ecr_repository.worker[0]: Read complete after 0s [id=exam-costa-worker]
aws_cloudwatch_metric_alarm.sqs_queue_depth[0]: Refreshing state... [id=exam-costa-production-sqs-queue-depth]
module.iam_api_task_role.aws_iam_role_policy.inline["ssm_access"]: Refreshing state... [id=exam-costa-production-api-task-role:ssm_access]
module.iam_api_task_role.aws_iam_role_policy.inline["sqs_send"]: Refreshing state... [id=exam-costa-production-api-task-role:sqs_send]
module.ecs_service_api.aws_ecs_task_definition.main: Refreshing state... [id=exam-costa-production-api]
module.network.aws_route_table.public: Refreshing state... [id=rtb-0cdea77588eaa76cd]
module.network.aws_route_table.private[0]: Refreshing state... [id=rtb-0e4fdcb923818faee]
module.network.aws_subnet.private[0]: Refreshing state... [id=subnet-0b52860388deffe80]
module.network.aws_internet_gateway.main: Refreshing state... [id=igw-095fca6bd6d2590f3]
module.network.aws_subnet.private[1]: Refreshing state... [id=subnet-0aaa1811dba41e9a4]
module.alb.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:371670420772:targetgroup/exam-costa-production-alb-tg/a0a346fcc64fe801]
module.network.aws_subnet.public[0]: Refreshing state... [id=subnet-0a0458182fd609f95]
aws_security_group.worker_service: Refreshing state... [id=sg-0e41a8c7e34a85334]
aws_security_group.alb: Refreshing state... [id=sg-0d145d38225856f47]
module.network.aws_subnet.public[1]: Refreshing state... [id=subnet-000e429fa7c32b15f]
module.s3_messages.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=exam-costa-production-messages-371670420772]
module.s3_messages.aws_s3_bucket_versioning.this: Refreshing state... [id=exam-costa-production-messages-371670420772]
module.s3_messages.aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=exam-costa-production-messages-371670420772]
module.network.aws_vpc_endpoint.s3[0]: Refreshing state... [id=vpce-05bf885d6b7941237]
module.network.aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-0cdea77588eaa76cd1080289494]
module.network.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0346952372c111e08]
module.iam_worker_task_role.aws_iam_role_policy.inline["s3_upload"]: Refreshing state... [id=exam-costa-production-worker-task-role:s3_upload]
module.iam_worker_task_role.aws_iam_role_policy.inline["sqs_receive"]: Refreshing state... [id=exam-costa-production-worker-task-role:sqs_receive]
module.ecs_service_worker.aws_ecs_task_definition.main: Refreshing state... [id=exam-costa-production-worker]
aws_security_group.api_service: Refreshing state... [id=sg-01a70e18bcf3af7b9]
module.network.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-02e2f1d0878f97e59]
module.network.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-02aca4e52672314dd]
module.network.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-03aa2c1de3c77fe44]
module.network.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0d6fa3effe2aee3b7]
module.ecs_service_worker.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:us-east-2:371670420772:service/exam-costa-production-cluster/exam-costa-production-worker]
module.alb.aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:371670420772:loadbalancer/app/exam-costa-production-alb/8b3211962fbfe865]
module.ecs_service_api.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:us-east-2:371670420772:service/exam-costa-production-cluster/exam-costa-production-api]
module.network.aws_nat_gateway.main[0]: Refreshing state... [id=nat-091236ba60d259488]
module.network.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0e4fdcb923818faee1080289494]
aws_ssm_parameter.infra_output["s3_bucket_name"]: Refreshing state... [id=/exam-costa/production/outputs/s3_bucket_name]
aws_ssm_parameter.infra_output["api_service_name"]: Refreshing state... [id=/exam-costa/production/outputs/api_service_name]
aws_ssm_parameter.infra_output["ecs_cluster_name"]: Refreshing state... [id=/exam-costa/production/outputs/ecs_cluster_name]
aws_ssm_parameter.infra_output["sqs_queue_url"]: Refreshing state... [id=/exam-costa/production/outputs/sqs_queue_url]
aws_ssm_parameter.infra_output["alb_url"]: Refreshing state... [id=/exam-costa/production/outputs/alb_url]
aws_ssm_parameter.infra_output["worker_service_name"]: Refreshing state... [id=/exam-costa/production/outputs/worker_service_name]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:371670420772:listener/app/exam-costa-production-alb/8b3211962fbfe865/91b866ec4ce7621c]
aws_cloudwatch_dashboard.main[0]: Refreshing state... [id=exam-costa-production]
module.alb.aws_lb_listener.https[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:371670420772:listener/app/exam-costa-production-alb/8b3211962fbfe865/7c9ed1d74c6ad2bc]
aws_cloudwatch_metric_alarm.alb_unhealthy_targets[0]: Refreshing state... [id=exam-costa-production-alb-unhealthy-targets]
aws_ssm_parameter.cloudwatch_dashboard_url[0]: Refreshing state... [id=/exam-costa/production/outputs/cloudwatch_dashboard_url]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service_worker.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-2:371670420772:service/exam-costa-production-cluster/exam-costa-production-worker"
        name                               = "exam-costa-production-worker"
        tags                               = {
            "CostCenter"  = "devops-exam"
            "Environment" = "production"
            "ManagedBy"   = "terraform"
            "Owner"       = "costa"
            "Project"     = "DevOps Exam Costa"
            "Purpose"     = "exam-submission"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-2:371670420772:task-definition/exam-costa-production-worker:3" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ecs_service_worker.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-2:371670420772:task-definition/exam-costa-production-worker:3" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:371670420772:task-definition/exam-costa-production-worker" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image            = "371670420772.dkr.ecr.us-east-2.amazonaws.com/exam-costa-worker:v2.0.0" -> "371670420772.dkr.ecr.us-east-2.amazonaws.com/exam-costa-worker:v2.0.1"
                    name             = "worker"
                  - systemControls   = []
                    # (8 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "exam-costa-production-worker" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
        tags                     = {
            "CostCenter"  = "devops-exam"
            "Environment" = "production"
            "ManagedBy"   = "terraform"
            "Owner"       = "costa"
            "Project"     = "DevOps Exam Costa"
            "Purpose"     = "exam-submission"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ deployment_info            = {
      ~ worker_image = "371670420772.dkr.ecr.us-east-2.amazonaws.com/exam-costa-worker:v2.0.0" -> "371670420772.dkr.ecr.us-east-2.amazonaws.com/exam-costa-worker:v2.0.1"
        # (6 unchanged attributes hidden)
    }
  ~ worker_task_definition_arn = "arn:aws:ecs:us-east-2:371670420772:task-definition/exam-costa-production-worker:3" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>